# Remove Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElectricalSystem..::..Remove Method
ElectricalSystem Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Remove(ConnectorSet) | Removes connectors from system. (Inherited from MEPSystem.) |
| Remove(ICollection<(Of <<'(ElementId>)>>)) | Remove elements from system. (Inherited from MEPSystem.) |

# See Also
ElectricalSystem Class
ElectricalSystem Members
Autodesk.Revit.DB.Electrical Namespace